# 9
# Напишите программу, в которой создается массив и заполняется
# случайными числами. Массив отображается в консольном окне. В этом
# массиве необходимо определить элемент с минимальным значением. В
# частности, программа должна вывести значение элемента с минимальным
# значением и индекс этого элемента. Если элементов с минимальным
# значением несколько, должны быть выведены индексы всех этих элементов.

# import random
# list = [2,2,1]
# # k = 0
# # site = int(random.uniform(5,10))
# # while k < site:
#     list.append(int(random.uniform(0,20)))
# #     k +=1
# list.sort()
# while list[0] == list[1]
#
# print(list, max(list), list.index(max(list)))