# 3 Напишите программу, в которой Пользователь последовательно вводит
# название текущего дня недели, название месяца и дату (номер дня в месяце).
# Программа выводит сообщение о сегодняшней дате (день недели, дата, месяц).
d_w, month, day = input(), input(), input()
print(f'Сегодня  - {d_w}, {day}, {month}!')
# 4 Напишите программу, в которой пользователю предлагается ввести
# название месяца и количество дней в этом месяце. Программа выводит
# сообщение о том, что соответствующий месяц содержит указанное количество
# дней.
# 5 Напишите программу, в которой по году рождения определяется возраст
# пользователя.
# 6 Напишите программу, в которой Пользователь вводит имя и год рождения, в
# программа отображает сообщение содержащее имя пользователя и его
# возраст.
# 7 Напишите программу, в которой по возрасту определяется год рождения.
# 8 Напишите программу для вычисления суммы двух чисел. Оба числа
# вводятся пользователем. Для вычисления суммы используйте оператор +.
# 9 Напишите программу, в которой пользователь вводит число, а программой
# отображается последовательность из четырех чисел: число, на единицу
# меньше введённого, введенное число и число, на единицу больше введенного.
# Четвертое число должно быть квадратом суммы первых трех чисел.
# 10 Напишите программу, в которой Пользователь вводит два числа, а
# программой вычисляется и отображается сумма и разность этих чисел.